////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Практическое задание 2                                                                                         //
// Создать собственный манипулятор endll для стандартного потока вывода, который выводит два перевода строки и    //
// сбрасывает буфер                                                                                               //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <iostream>

class Endll
{
    // Не совсем понял зачем в примере так. Без этого тоже работает.
    friend std::ostream& operator << (std::ostream& endll, Endll);
};

std::ostream& operator << (std::ostream& endll, Endll)
{
   return { endll << "\n\n" << std::flush};
}

int main()
{
    setlocale(LC_ALL, "Russian");
    
    Endll endll;
    std::cout << "Практическое задание 3" << endll;
    std::cout << "-------" << std::endl;    

    return 0;
}