////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Практическое задание 1                                                                                         //
// Создать программу, которая считывает целое число типа int. И поставить «защиту от дурака»:                     //
// если пользователь вводит что-то кроме одного целочисленного значения, нужно вывести сообщение об ошибке и      //
// предложить ввести число еще раз.                                                                               //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <iostream>

// Чистим поток
inline void clearStream() 
{
    while (std::cin.get() != '\n') 
        continue; 
}

// Запрос целого числа
int getInt()
{
    int num;
    std::cin >> num;
    while(1)
    {
        if(std::cin.fail())
        {
            std::cin.clear();
            clearStream();
            std::cout <<"Вы неверно ввели целое число" << std::endl;
            std::cout << "Введите снова целое число: ";
            std::cin >> num;
        }
        if(!std::cin.fail())
        break;
    }

    return num;
}

int main()
{
    setlocale(LC_ALL, "Russian");

    int num;
    std::cout << "Введите целое число: ";
    num = getInt();
    std::cout << "введенное целое число: " << num << std::endl;

    return 0;
}