////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задание 1                                                                                                      //
// Создать класс Power, который содержит два вещественных числа. Этот класс должен иметь две переменные-члена для //
// хранения этих вещественных чисел. Еще создать два метода: один с именем set, который позволит присваивать      //
// значения объявленным в классе переменным, второй — calculate, который будет выводить результат возведения      //
// первого числа в степень второго числа. Задать значения этих двух чисел по умолчанию.                           //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <iostream>
#include <cmath>

class Power {
private:
    double base = 0, exponent = 0;

public:
    void set(double base = 0, double exponent = 0) {
        this->base = base;
        this->exponent = exponent;
    }

    void calculate() {
        std::cout << "Значение " << base << " в степени " << exponent << " = " << pow(base, exponent) << std::endl;
    }
};

int main()
{
    setlocale(LC_ALL, "Russian");

    Power power;
    power.calculate();
    power.set(3, 2);
    power.calculate();

    return 0;
}