////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задание 2                                                                                                      //
// Дан вектор чисел, требуется выяснить, сколько среди них различных.                                             //
// Постараться использовать максимально быстрый алгоритм.                                                         //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <iostream>
#include <vector>
#include<set>

int main()
{
    setlocale(LC_ALL, "Russian");

    std::vector<int> vector_of_nums({ 1, 2, 2, 1, 3, 1, 4 });
    std::cout << "Дан вектор: ";
    for (const int& i : vector_of_nums) {
        std::cout << i << " ";
    }

    // Получим набор
    std::set<int> set_of_nums(vector_of_nums.begin(), vector_of_nums.end());
    // Размер набора дает нам количество различных чисел
    std::cout << std::endl << "Различных чисел в векторе: " << set_of_nums.size() << std::endl;

    return 0;
}